In [1]:
import os
from twelvedata import TDClient
import pandas as pd
from datetime import datetime, timedelta
import pytz

In [2]:
os.getcwd()

'/app'

In [16]:
td = TDClient(apikey="45d1cfb01d4d4677a1a158bd46a97b84")

# 1. SPY

In [12]:
ts = td.time_series(
        symbol="SPY",
        interval="1day",
        start_date="2010-01-01",
        end_date="2019-12-31",
        outputsize=5000
    )
data_df = ts.as_pandas()

In [13]:
print(data_df.shape)
data_df.head()

(2515, 5)

                 open       high        low      close    volume
datetime
2019-12-30  322.95001  323.10001  320.54999  321.07999  49729100
2019-12-27  323.73999  323.79999  322.28000  322.85999  42528800
2019-12-26  321.64999  322.95001  321.64001  322.94000  30911200
2019-12-24  321.47000  321.51999  320.89999  321.23001  20270000
2019-12-23  321.59000  321.64999  321.06000  321.22000  52990000

In [17]:
ts = td.time_series(
        symbol="SPY",
        interval="1day",
        start_date="2020-01-01",
        outputsize=5000
    )
data_2_df = ts.as_pandas()

In [16]:
print(data_2_df.shape)
data_2_df.head()

(1411, 5)

                 open       high        low      close    volume
datetime
2025-08-13  644.90000  646.17500  643.59000  643.91000    763342
2025-08-12  638.28998  642.84998  636.78998  642.69000  64730800
2025-08-11  637.46002  638.95001  634.65997  635.91998  58742300
2025-08-08  634.06000  637.65002  633.73999  637.17999  64051600
2025-08-07  636.23999  636.97998  629.10999  632.25000  74205800

In [19]:
total_df = pd.concat([data_2_df, data_df], axis=0)
print(total_df.shape)
total_df.head()

(3926, 5)

                 open       high        low      close    volume
datetime
2025-08-13  644.90000  646.17500  643.59000  643.91000    763342
2025-08-12  638.28998  642.84998  636.78998  642.69000  64730800
2025-08-11  637.46002  638.95001  634.65997  635.91998  58742300
2025-08-08  634.06000  637.65002  633.73999  637.17999  64051600
2025-08-07  636.23999  636.97998  629.10999  632.25000  74205800

In [21]:
total_df.sort_index(inplace=True)

In [23]:
total_df.to_csv("/data/spy_data.csv")

# 2. USD/KRW

In [7]:
ts = td.time_series(
    symbol="USD/KRW",
    interval="1day",
    start_date="2010-01-01",
    end_date="2019-12-31",
    outputsize=5000
)
data_1_df = ts.as_pandas()

In [9]:
print(data_1_df.shape)
data_1_df.head()

(2601, 4)

                  open        high         low       close
datetime
2019-12-27  1160.10999  1161.89001  1156.39001  1161.19995
2019-12-26  1159.75000  1163.65002  1159.15002  1159.75000
2019-12-25  1161.30005  1162.22998  1159.73999  1162.22998
2019-12-24  1161.53003  1165.51001  1158.81995  1161.56995
2019-12-23  1160.32996  1164.29004  1159.05005  1159.30005

In [10]:
ts = td.time_series(
        symbol="USD/KRW",
        interval="1day",
        start_date="2020-01-01",
        outputsize=5000
    )
data_2_df = ts.as_pandas()

In [11]:
print(data_2_df.shape)
data_2_df.head()

(1489, 4)

                  open        high         low       close
datetime
2025-08-13  1384.00000  1386.41003  1374.78003  1379.59998
2025-08-12  1390.58997  1392.81995  1383.00000  1383.97998
2025-08-11  1388.78003  1394.31006  1385.07996  1390.58997
2025-08-09  1388.76001  1388.76001  1388.76001  1388.76001
2025-08-08  1383.51001  1391.64001  1378.97998  1389.67004

In [12]:
total_df = pd.concat([data_2_df, data_1_df], axis=0)
total_df.sort_index(inplace=True)
print(total_df.shape)
total_df.head()

(4090, 4)

                  open        high         low       close
datetime
2009-12-31  1161.50000  1161.90002  1144.00000  1151.09998
2010-01-01  1151.09998  1151.09998  1145.09998  1146.00000
2010-01-04  1152.09998  1156.30005  1132.40002  1132.40002
2010-01-05  1132.30005  1142.30005  1128.90002  1141.30005
2010-01-06  1141.09998  1143.50000  1123.69995  1130.40002

In [ ]:
total_df.to_csv("/data/usdkrw_data.csv")